# Brewfile — eufelipe/dev-environment (Mac M5)
# Instala com:  brew bundle --file=~/.local/share/chezmoi/Brewfile
# Java vem do mise; CocoaPods via Bundler por projeto (não aqui).

tap "homebrew/bundle"

# Core
brew "git"
brew "gh"
brew "chezmoi"
brew "mise"
brew "jq"
brew "yq"
brew "openssl"
brew "ca-certificates"

# Shell e terminal
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "fzf"
brew "zoxide"
brew "eza"
brew "bat"
brew "ripgrep"
brew "fd"
brew "tree"
brew "btop"
brew "tldr"

# Dev UX
brew "lazygit"
brew "git-delta"
brew "git-lfs"
brew "trash"
brew "httpie"
brew "act"

# Containers
brew "docker"
brew "docker-compose"

# React Native
brew "watchman"
brew "fastlane"

# Segurança e supply chain
brew "gitleaks"
brew "trivy"
brew "semgrep"

# 1Password CLI
brew "1password-cli"

# --- Apps (cask) ---
cask "1password"
cask "orbstack"
cask "cursor"
cask "warp"
cask "android-studio"
cask "brave-browser"
cask "figma"
cask "stats"
cask "raycast"
cask "obsidian"
cask "notion"

# Migrados do SOFTWARES.md / curadoria do guia (avaliar)
cask "dbeaver-community"   # ou TablePlus (pago, nativo) / Beekeeper Studio
cask "sidenotes"
cask "shottr"
cask "keka"                # no lugar do The Unarchiver
cask "bruno"               # cliente de API local-first (no lugar do Apidog)

# Opcionais / hypados (descomente o que quiser testar)
# cask "ghostty"           # terminal nativo sem conta (alt. ao Warp)
# cask "zed"               # editor Rust com IA
# cask "superwhisper"      # ditado voz→texto p/ prompts de agente
# cask "discord"
# cask "languagetool"
